# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, CPIB, [128]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, CPIB, [256]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, CPIB, [512]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, CPIB, [1024]]
  - [-1, 1, SPPF, [1024, 5]] # 9

# YOLOv8.0n head
head:
  - [[2, 4, 6], 1, SAVSSB, [256, 896]] # 10
  - [[4, 6, 8], 1, SAVSSB, [512, 1792]] # 11
  - [[6, 8], 1, SAVSSB, [1024, 1536]] # 12
  
  - [10, 1, Conv, [256, 3, 2]] #13
  - [12, 1, nn.Upsample, [None, 2, "nearest"]] #14
  
  - [[11, 13, 14], 1, Concat, [1]] # 15
  - [-1, 3, CPIB, [512]] #16
  - [-1, 1, Conv, [512]] #17

  - [16, 1, nn.Upsample, [None, 2, "nearest"]] #18
  - [[-1, 10], 1, Concat, [1]] # 19
  - [-1, 3, CPIB, [256]] # 20

  - [16, 1, Conv, [512, 3, 2]] #21
  - [[-1, 12, 9], 1, Concat, [1]] # 22
  - [-1, 3, CPIB, [1024]] # 23

  - [[20, 17, 23], 1, HMDADetect, [nc]] # Detect(P3, P4, P5)
